------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/albertocottica/github/local/communities-network-design/Stata files/Signature_regression.log
  log type:  text
 opened on:  14 Jun 2015, 23:37:04

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. reg pv_all i.Nu1##i.Nu2

      Source |       SS       df       MS              Number of obs =    3600
-------------+------------------------------           F( 35,  3564) =    5.44
       Model |  2.15768167    35  .061648048           Prob > F      =  0.0000
    Residual |  40.4169084  3564  .011340322           R-squared     =  0.0507
-------------+------------------------------           Adj R-squared =  0.0414
       Total |  42.5745901  3599  .011829561           Root MSE      =  .10649

------------------------------------------------------------------------------
      pv_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Nu1 |
          2  |    .003592   .0150601     0.24   0.811    -.0259353    .0331193
          3  |    .045376   .0150601     3.01   0.003     .0158487    .0749033
          4  |    .037088   .0150601     2.46   0.014     .0075607    .0666153
          5  |    .073304   .0150601     4.87   0.000     .0437767    .1028313
          6  |    .041556   .0150601     2.76   0.006     .0120287    .0710833
             |
         Nu2 |
          2  |    .000784   .0150601     0.05   0.958    -.0287433    .0303113
          3  |   -.007352   .0150601    -0.49   0.625    -.0368793    .0221753
          4  |   -.011376   .0150601    -0.76   0.450    -.0409033    .0181513
          5  |    -.00424   .0150601    -0.28   0.778    -.0337673    .0252873
          6  |   -.007916   .0150601    -0.53   0.599    -.0374433    .0216113
             |
     Nu1#Nu2 |
        2 2  |    .015968   .0212982     0.75   0.453    -.0257899    .0577259
        2 3  |    .029696   .0212982     1.39   0.163    -.0120619    .0714539
        2 4  |    .031884   .0212982     1.50   0.134    -.0098739    .0736419
        2 5  |    .023488   .0212982     1.10   0.270    -.0182699    .0652459
        2 6  |    .024608   .0212982     1.16   0.248    -.0171499    .0663659
        3 2  |   -.008472   .0212982    -0.40   0.691    -.0502299    .0332859
        3 3  |    .001268   .0212982     0.06   0.953    -.0404899    .0430259
        3 4  |    -.01024   .0212982    -0.48   0.631    -.0519979    .0315179
        3 5  |   -.017532   .0212982    -0.82   0.410    -.0592899    .0242259
        3 6  |    .018888   .0212982     0.89   0.375    -.0228699    .0606459
        4 2  |   -.011688   .0212982    -0.55   0.583    -.0534459    .0300699
        4 3  |    .013072   .0212982     0.61   0.539    -.0286859    .0548299
        4 4  |    .041848   .0212982     1.96   0.050     .0000901    .0836059
        4 5  |   -.001572   .0212982    -0.07   0.941    -.0433299    .0401859
        4 6  |   -.008832   .0212982    -0.41   0.678    -.0505899    .0329259
        5 2  |   -.018224   .0212982    -0.86   0.392    -.0599819    .0235339
        5 3  |   -.021648   .0212982    -1.02   0.309    -.0634059    .0201099
        5 4  |   -.012132   .0212982    -0.57   0.569    -.0538899    .0296259
        5 5  |   -.009548   .0212982    -0.45   0.654    -.0513059    .0322099
        5 6  |   -.001912   .0212982    -0.09   0.928    -.0436699    .0398459
        6 2  |    .019024   .0212982     0.89   0.372    -.0227339    .0607819
        6 3  |    .039048   .0212982     1.83   0.067    -.0027099    .0808059
        6 4  |    .026956   .0212982     1.27   0.206    -.0148019    .0687139
        6 5  |    .026396   .0212982     1.24   0.215    -.0153619    .0681539
        6 6  |    .027512   .0212982     1.29   0.197    -.0142459    .0692699
             |
       _cons |    .059312   .0106491     5.57   0.000     .0384331    .0801909
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. testparm i.Nu2

 ( 1)  2.Nu2 = 0
 ( 2)  3.Nu2 = 0
 ( 3)  4.Nu2 = 0
 ( 4)  5.Nu2 = 0
 ( 5)  6.Nu2 = 0

       F(  5,  3564) =    0.20
            Prob > F =    0.9623

. testparm i.Nu1#i.Nu2

 ( 1)  2.Nu1#2.Nu2 = 0
 ( 2)  2.Nu1#3.Nu2 = 0
 ( 3)  2.Nu1#4.Nu2 = 0
 ( 4)  2.Nu1#5.Nu2 = 0
 ( 5)  2.Nu1#6.Nu2 = 0
 ( 6)  3.Nu1#2.Nu2 = 0
 ( 7)  3.Nu1#3.Nu2 = 0
 ( 8)  3.Nu1#4.Nu2 = 0
 ( 9)  3.Nu1#5.Nu2 = 0
 (10)  3.Nu1#6.Nu2 = 0
 (11)  4.Nu1#2.Nu2 = 0
 (12)  4.Nu1#3.Nu2 = 0
 (13)  4.Nu1#4.Nu2 = 0
 (14)  4.Nu1#5.Nu2 = 0
 (15)  4.Nu1#6.Nu2 = 0
 (16)  5.Nu1#2.Nu2 = 0
 (17)  5.Nu1#3.Nu2 = 0
 (18)  5.Nu1#4.Nu2 = 0
 (19)  5.Nu1#5.Nu2 = 0
 (20)  5.Nu1#6.Nu2 = 0
 (21)  6.Nu1#2.Nu2 = 0
 (22)  6.Nu1#3.Nu2 = 0
 (23)  6.Nu1#4.Nu2 = 0
 (24)  6.Nu1#5.Nu2 = 0
 (25)  6.Nu1#6.Nu2 = 0

       F( 25,  3564) =    1.29
            Prob > F =    0.1553

. 
end of do-file

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. reg pv i.Nu1##i.Nu2

      Source |       SS       df       MS              Number of obs =    3600
-------------+------------------------------           F( 35,  3564) =    0.66
       Model |  1.29346849    35  .036956243           Prob > F      =  0.9371
    Residual |   199.13146  3564  .055873025           R-squared     =  0.0065
-------------+------------------------------           Adj R-squared = -0.0033
       Total |  200.424929  3599  .055689061           Root MSE      =  .23637

------------------------------------------------------------------------------
          pv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Nu1 |
          2  |     .01772   .0334284     0.53   0.596    -.0478208    .0832608
          3  |    .000792   .0334284     0.02   0.981    -.0647488    .0663328
          4  |    .026084   .0334284     0.78   0.435    -.0394568    .0916248
          5  |   -.019388   .0334284    -0.58   0.562    -.0849288    .0461528
          6  |   -.000688   .0334284    -0.02   0.984    -.0662288    .0648528
             |
         Nu2 |
          2  |   -.002304   .0334284    -0.07   0.945    -.0678448    .0632368
          3  |    .016352   .0334284     0.49   0.625    -.0491888    .0818928
          4  |    .023388   .0334284     0.70   0.484    -.0421528    .0889288
          5  |   -.000468   .0334284    -0.01   0.989    -.0660088    .0650728
          6  |    .033724   .0334284     1.01   0.313    -.0318168    .0992648
             |
     Nu1#Nu2 |
        2 2  |    .020644    .047275     0.44   0.662    -.0720447    .1133327
        2 3  |   -.049408    .047275    -1.05   0.296    -.1420967    .0432807
        2 4  |   -.060936    .047275    -1.29   0.197    -.1536247    .0317527
        2 5  |    .024128    .047275     0.51   0.610    -.0685607    .1168167
        2 6  |   -.026896    .047275    -0.57   0.569    -.1195847    .0657927
        3 2  |   -.001704    .047275    -0.04   0.971    -.0943927    .0909847
        3 3  |   -.025812    .047275    -0.55   0.585    -.1185007    .0668767
        3 4  |   -.025088    .047275    -0.53   0.596    -.1177767    .0676007
        3 5  |   -.009628    .047275    -0.20   0.839    -.1023167    .0830607
        3 6  |    .011396    .047275     0.24   0.810    -.0812927    .1040847
        4 2  |    .006452    .047275     0.14   0.891    -.0862367    .0991407
        4 3  |   -.050672    .047275    -1.07   0.284    -.1433607    .0420167
        4 4  |   -.018132    .047275    -0.38   0.701    -.1108207    .0745567
        4 5  |    .005168    .047275     0.11   0.913    -.0875207    .0978567
        4 6  |   -.033768    .047275    -0.71   0.475    -.1264567    .0589207
        5 2  |     .02538    .047275     0.54   0.591    -.0673087    .1180687
        5 3  |   -.014684    .047275    -0.31   0.756    -.1073727    .0780047
        5 4  |   -.005836    .047275    -0.12   0.902    -.0985247    .0868527
        5 5  |    .015572    .047275     0.33   0.742    -.0771167    .1082607
        5 6  |   -.025952    .047275    -0.55   0.583    -.1186407    .0667367
        6 2  |    .020556    .047275     0.43   0.664    -.0721327    .1132447
        6 3  |    -.02344    .047275    -0.50   0.620    -.1161287    .0692487
        6 4  |   -.011812    .047275    -0.25   0.803    -.1045007    .0808767
        6 5  |    -.01392    .047275    -0.29   0.768    -.1066087    .0787687
        6 6  |   -.044924    .047275    -0.95   0.342    -.1376127    .0477647
             |
       _cons |    .692568   .0236375    29.30   0.000     .6462237    .7389123
------------------------------------------------------------------------------

. 
end of do-file

. do "/Users/albertocottica/Documents/More PhD stuff/Sunbelt paper/results/Simulation Results/T-tests.do"

. 
. gen f_pva=pv_all if ob == 0
(3600 missing values generated)

. gen nu1_00_pva=pv_all if ob == 1 & nu1 == 0
(3100 missing values generated)

. gen nu1_01_pva=pv_all if ob == 1 & nu1 > .19 & nu1 < .21
(3100 missing values generated)

. gen nu1_04_pva=pv_all if ob == 1 & nu1 > .39 & nu1 < .41
(3100 missing values generated)

. gen nu1_06_pva=pv_all if ob == 1 & nu1 > .59 & nu1 < .61
(3100 missing values generated)

. gen nu1_08_pva=pv_all if ob == 1 & nu1 > .79 & nu1 < .81
(3100 missing values generated)

. gen nu1_10_ova=pv_all if ob == 1 & nu1 == 1
(3100 missing values generated)

. gen nu2_00_pva=pv_all if ob == 1 & nu2 == 0
(3100 missing values generated)

. gen nu2_02_pva=pv_all if ob == 1 & nu2 > .19 & nu2 < .21
(3100 missing values generated)

. gen nu2_04_pva=pv_all if ob == 1 & nu2 > .39 & nu2 < .41
(3100 missing values generated)

. gen nu2_06_pva=pv_all if ob == 1 & nu2 > .59 & nu2 < .61
(3100 missing values generated)

. gen nu2_08_pva=pv_all if ob == 1 & nu2 > .79 & nu2 < .81
(3100 missing values generated)

. gen nu2_10_ova=pv_all if ob == 1 & nu2 == 1
(3100 missing values generated)

. 
. macro def pv_allz f_pva nu1_00_pva nu1_02_pva nu1_04_pva nu1_06_pva nu1_08_pva nu1_10_pva ///
> nu2_00_pva nu2_02_pva nu2_04_pva nu2_06_pva nu2_08_pva nu2_10_pva

. 
. foreach X in $pv_allz  {
  2.         foreach Y in $pv_allz {
  3.                 ttest `X' == `Y'
  4.                 }
  5.         }

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
   f_pva |     100     .262688      .01981    .1981004    .2233806    .3019954
   f_pva |     100     .262688      .01981    .1981004    .2233806    .3019954
---------+--------------------------------------------------------------------
    diff |     100           0           0           0           0           0
------------------------------------------------------------------------------
     mean(diff) = mean(f_pva - f_pva)                             t =        .
 Ho: mean(diff) = 0                              degrees of freedom =       99

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) =      .         Pr(|T| > |t|) =      .          Pr(T > t) =      .
no observations
r(2000);

end of do-file

r(2000);

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. macro def pv_allz nu1_00_pva nu1_02_pva nu1_04_pva nu1_06_pva nu1_08_pva nu1_10_pva ///
> nu2_00_pva nu2_02_pva nu2_04_pva nu2_06_pva nu2_08_pva nu2_10_pva

. 
end of do-file

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. foreach X in $pv_allz  {
  2.         ttest `X' == `Y'
  3.         }
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. foreach X in $pv_allz  {
  2.         ttest `X' == f_pva
  3.         }
no observations
r(2000);

end of do-file

r(2000);

. clear

. use "/Users/albertocottica/github/local/communities-network-design/Stata files/allDataFittings.dta"

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. egen Nu1=group(nu1)
(100 missing values generated)

. egen Nu2=group(nu2)
(100 missing values generated)

. 
end of do-file

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. reg pv i.Nu1##i.Nu2

      Source |       SS       df       MS              Number of obs =    3600
-------------+------------------------------           F( 35,  3564) =    0.66
       Model |  1.29346849    35  .036956243           Prob > F      =  0.9371
    Residual |   199.13146  3564  .055873025           R-squared     =  0.0065
-------------+------------------------------           Adj R-squared = -0.0033
       Total |  200.424929  3599  .055689061           Root MSE      =  .23637

------------------------------------------------------------------------------
          pv |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Nu1 |
          2  |     .01772   .0334284     0.53   0.596    -.0478208    .0832608
          3  |    .000792   .0334284     0.02   0.981    -.0647488    .0663328
          4  |    .026084   .0334284     0.78   0.435    -.0394568    .0916248
          5  |   -.019388   .0334284    -0.58   0.562    -.0849288    .0461528
          6  |   -.000688   .0334284    -0.02   0.984    -.0662288    .0648528
             |
         Nu2 |
          2  |   -.002304   .0334284    -0.07   0.945    -.0678448    .0632368
          3  |    .016352   .0334284     0.49   0.625    -.0491888    .0818928
          4  |    .023388   .0334284     0.70   0.484    -.0421528    .0889288
          5  |   -.000468   .0334284    -0.01   0.989    -.0660088    .0650728
          6  |    .033724   .0334284     1.01   0.313    -.0318168    .0992648
             |
     Nu1#Nu2 |
        2 2  |    .020644    .047275     0.44   0.662    -.0720447    .1133327
        2 3  |   -.049408    .047275    -1.05   0.296    -.1420967    .0432807
        2 4  |   -.060936    .047275    -1.29   0.197    -.1536247    .0317527
        2 5  |    .024128    .047275     0.51   0.610    -.0685607    .1168167
        2 6  |   -.026896    .047275    -0.57   0.569    -.1195847    .0657927
        3 2  |   -.001704    .047275    -0.04   0.971    -.0943927    .0909847
        3 3  |   -.025812    .047275    -0.55   0.585    -.1185007    .0668767
        3 4  |   -.025088    .047275    -0.53   0.596    -.1177767    .0676007
        3 5  |   -.009628    .047275    -0.20   0.839    -.1023167    .0830607
        3 6  |    .011396    .047275     0.24   0.810    -.0812927    .1040847
        4 2  |    .006452    .047275     0.14   0.891    -.0862367    .0991407
        4 3  |   -.050672    .047275    -1.07   0.284    -.1433607    .0420167
        4 4  |   -.018132    .047275    -0.38   0.701    -.1108207    .0745567
        4 5  |    .005168    .047275     0.11   0.913    -.0875207    .0978567
        4 6  |   -.033768    .047275    -0.71   0.475    -.1264567    .0589207
        5 2  |     .02538    .047275     0.54   0.591    -.0673087    .1180687
        5 3  |   -.014684    .047275    -0.31   0.756    -.1073727    .0780047
        5 4  |   -.005836    .047275    -0.12   0.902    -.0985247    .0868527
        5 5  |    .015572    .047275     0.33   0.742    -.0771167    .1082607
        5 6  |   -.025952    .047275    -0.55   0.583    -.1186407    .0667367
        6 2  |    .020556    .047275     0.43   0.664    -.0721327    .1132447
        6 3  |    -.02344    .047275    -0.50   0.620    -.1161287    .0692487
        6 4  |   -.011812    .047275    -0.25   0.803    -.1045007    .0808767
        6 5  |    -.01392    .047275    -0.29   0.768    -.1066087    .0787687
        6 6  |   -.044924    .047275    -0.95   0.342    -.1376127    .0477647
             |
       _cons |    .692568   .0236375    29.30   0.000     .6462237    .7389123
------------------------------------------------------------------------------

. 
end of do-file

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. testparm i.Nu1

 ( 1)  2.Nu1 = 0
 ( 2)  3.Nu1 = 0
 ( 3)  4.Nu1 = 0
 ( 4)  5.Nu1 = 0
 ( 5)  6.Nu1 = 0

       F(  5,  3564) =    0.46
            Prob > F =    0.8099

. 
end of do-file

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. egen Nu1=group(nu1)
Nu1 already defined
r(110);

end of do-file

r(110);

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. testparm i.Nu2

 ( 1)  2.Nu2 = 0
 ( 2)  3.Nu2 = 0
 ( 3)  4.Nu2 = 0
 ( 4)  5.Nu2 = 0
 ( 5)  6.Nu2 = 0

       F(  5,  3564) =    0.40
            Prob > F =    0.8474

. 
end of do-file

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. egen Nu1=group(nu1)
Nu1 already defined
r(110);

end of do-file

r(110);

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. testparm i.Nu1#i.Nu2

 ( 1)  2.Nu1#2.Nu2 = 0
 ( 2)  2.Nu1#3.Nu2 = 0
 ( 3)  2.Nu1#4.Nu2 = 0
 ( 4)  2.Nu1#5.Nu2 = 0
 ( 5)  2.Nu1#6.Nu2 = 0
 ( 6)  3.Nu1#2.Nu2 = 0
 ( 7)  3.Nu1#3.Nu2 = 0
 ( 8)  3.Nu1#4.Nu2 = 0
 ( 9)  3.Nu1#5.Nu2 = 0
 (10)  3.Nu1#6.Nu2 = 0
 (11)  4.Nu1#2.Nu2 = 0
 (12)  4.Nu1#3.Nu2 = 0
 (13)  4.Nu1#4.Nu2 = 0
 (14)  4.Nu1#5.Nu2 = 0
 (15)  4.Nu1#6.Nu2 = 0
 (16)  5.Nu1#2.Nu2 = 0
 (17)  5.Nu1#3.Nu2 = 0
 (18)  5.Nu1#4.Nu2 = 0
 (19)  5.Nu1#5.Nu2 = 0
 (20)  5.Nu1#6.Nu2 = 0
 (21)  6.Nu1#2.Nu2 = 0
 (22)  6.Nu1#3.Nu2 = 0
 (23)  6.Nu1#4.Nu2 = 0
 (24)  6.Nu1#5.Nu2 = 0
 (25)  6.Nu1#6.Nu2 = 0

       F( 25,  3564) =    0.50
            Prob > F =    0.9826

. 
end of do-file

. ttest exp_all if ob == 0 exp_all if on == 1
invalid 'exp_all' 
r(198);

. ttest exp_all == exp

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 exp_all |    3700    1.810101    .0007658    .0465801      1.8086    1.811602
     exp |    3700    2.709205    .0040714    .2476546    2.701223    2.717188
---------+--------------------------------------------------------------------
    diff |    3700   -.8991042    .0036066    .2193826   -.9061754    -.892033
------------------------------------------------------------------------------
     mean(diff) = mean(exp_all - exp)                             t = -2.5e+02
 Ho: mean(diff) = 0                              degrees of freedom =     3699

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. gen f_exp_all if ob == 0
=exp required
r(100);

end of do-file

r(100);

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. egen f_exp_all if ob == 0
invalid syntax
r(198);

end of do-file

r(198);

. do "/var/folders/n8/szbcd5613wg9bk3r40lyrdlr0000gn/T//SD08074.000000"

. egen f_exp_all = exp_all if ob == 0
unknown egen function exp_all()
r(133);

end of do-file

r(133);

